noble1911/pet-esp/firmware/sdkconfig.defaults
# ESP-IDF defaults for the Waveshare ESP32-S3-Touch-AMOLED-1.8.
# Checked in; per-build sdkconfig is generated and gitignored.

CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB, QIO (architecture §1)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# PSRAM: 8 MB octal. Sprite buffers (~500 KB, architecture §5.4) live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# 1 kHz tick for smooth UI / animation timing (architecture §5.5)
CONFIG_FREERTOS_HZ=1000

# NVS holds the single Pet blob (architecture §4.1)
CONFIG_NVS_ENCRYPTION=n
